Revit 2027 API
DirectShapeLibrary.AddDefinition(String, GeometryObject) Method
 Add a definition to be reused by instances. A definition is a single geometry object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddDefinition(
	string id,
	GeometryObject GNode
)
Public Sub AddDefinition (
	id As String,
	GNode As GeometryObject
)
public:
void AddDefinition(
	String^ id,
	GeometryObject^ GNode
)
member AddDefinition :
        id : string *
        GNode : GeometryObject -> unit
Parameters
id String
 ID of the definition to be added. Must be unique.
GNode GeometryObject
 Definition as a single Geometry object
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectShapeLibrary Class
AddDefinition Overload
Autodesk.Revit.DB Namespace